# Relatório II
## Tipos de Imóveis

# A Tarefa:
## O "chefe" pediu pra nós apenas utilizarmos seguros para imóveis residenciais, temos que limpar os terrenos, lojas e etc...
### Identificar todos tipos de imóveis no data frame

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
dados = pd.read_csv('aluguel.csv', sep=';')
dados.head(10)

In [ ]:
# a tarefa gira em torno da coluna "Tipo"
dados.Tipo.head(10)
dados['Tipo'].head(10)
#vai retornar uma pd.series

In [ ]:
tipo_de_imovel = dados.Tipo
tipo_de_imovel

In [ ]:
type(tipo_de_imovel)
#virou uma series!

In [ ]:
#identificando os tipos de imovel
tipo_de_imovel.unique()

In [ ]:
#removendo os duplicados!
tipo_de_imovel.drop_duplicates()
tipo_de_imovel

In [ ]:
#IMPORTANTE:
# o método drop_duplicates() leva dois parametros (keep='first') que é por padrão manter o primeiro, e (inplace='false') que é pra não mudar a variavel quando executamos o método
# deixando o (inplace = True) quando executamos ele já vai mudar a variável em sí

In [ ]:
tipo_de_imovel.drop_duplicates(inplace=True)
tipo_de_imovel

# Deixando mais bonito, organizando a visualização

In [40]:
#transformando a séries em dataframe
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)
tipo_de_imovel

                              Tipo
0                        Quitinete
1                             Casa
2          Conjunto Comercial/Sala
3                      Apartamento
7               Casa de Condomínio
16                  Prédio Inteiro
17                            Flat
29                      Loja/Salão
80         Galpão/Depósito/Armazém
83                  Casa Comercial
117                   Casa de Vila
159                 Terreno Padrão
207                    Box/Garagem
347                           Loft
589    Loja Shopping/ Ct Comercial
2157                       Chácara
3354         Loteamento/Condomínio
4379                         Sítio
4721                 Pousada/Chalé
6983                        Studio
9687                         Hotel
23614                    Indústria

In [47]:
# modificando o index
tipo_de_imovel.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [48]:
#temos que fazer um loop
tipo_de_imovel.shape[0] # tamanho do index do data frame // pode user (len(tipo_de_imovel)):

22

In [57]:
#loop 
for i in range(len(tipo_de_imovel)):
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21

In [56]:
#colocando o index no dataframe
tipo_de_imovel.index = range(len(tipo_de_imovel))
tipo_de_imovel

ID                   Quantidade
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

In [55]:
#Colocando um nome na primeira Coluna
tipo_de_imovel.columns.name = 'ID'
tipo_de_imovel

ID                   Quantidade
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

# Aula Extra - Criando um DataFrame

In [58]:
data = [1,2,3,4,5]

In [62]:
#transforamndo em series
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [64]:
# Criando rótulos paras linhas do pd.Series
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [67]:
# Colocando os rótulos
s = pd.Series(data, index) # podemos passar um parametro como index, como colocamos ali!
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [69]:
# outra forma
data = {'Linha' + str(i) : i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [72]:
# agora colocando no index
s = pd.Series(data) # não precisa colocar o parametro index, pq como é dicionario ele já vai pegar automaticamente, chave e valor
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [73]:
# fazendo operações nas Series
s1 = s + 2 # somando 2 em cada uma das linhas
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [74]:
# somando uma serie por outra
s2 = s + s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# Aula Extra - Concatenando dataFrames

In [75]:
#criando um dataFrame

data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [78]:
df1 = pd.DataFrame(data = data)

In [77]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [81]:
# colocando rótulo nas linhas
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [82]:
# rotulos
df1 = pd.DataFrame(data, index, )

In [83]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [86]:
# colocando nome nas colunas
colunas = ['Coluna' + str(i) for i in range(3)]
df1 = pd.DataFrame(data,index,colunas)

In [87]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [88]:
# fazendo uma dataframe utilizando um dicionario
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [91]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [92]:
# agora com tuplas
data = data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
df3 = pd.DataFrame(data = data, index = index, columns = colunas)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

# Concatenano data Frames

In [93]:
# se os valores de df1 forem maior que 0 vai alterar todos valores para 'A'
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [94]:
# mesma coisa
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [95]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [96]:
df4 = df1 + df2 + df3 

df4

       Coluna0 Coluna1 Coluna2
Linha0     ABC     ABC     ABC
Linha1     ABC     ABC     ABC
Linha2     ABC     ABC     ABC

In [101]:
# JUNTANDO OS 3 DATA FRAMES
df5 = pd.concat([df1,df2,df3], axis=0) # axis = 0 vai stackar um data frame acima do outro
df5
#podemos perceber que podemos ter rótulos iguais para linhas diferentes
# isso é interessante quando queremos que linhas diferentes sejam identificadas por um mesmo rótulo

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [100]:
# fazendo a msm coisa da linha acima só que com o axis = 1
df5 = pd.concat([df1, df2, df3], axis = 1) # vai ao invez de stackar os data frames vai deixar um do lado do outro
df5

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

In [102]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6